In [1]:
import pandas as pd
#import seaborn as sns

### Read in the public art data, drop the `Mapped Location` column and rename columns to lower case without spaces

In [2]:
art = pd.read_csv('../data/public_art.csv')
art.head(2)

,Title,Last Name,First Name,Location,Medium,Type,Description,Latitude,Longitude,Mapped Location
0,[Cross Country Runners],Frost,Miley,"4001 Harding Rd., Nashville TN",Bronze,Sculpture,NaN,36.12856,-86.83660,"(36.12856, -86.8366)"
1,[Fourth and Commerce Sculpture],Walker,Lin,"333 Commerce Street, Nashville TN",NaN,Sculpture,NaN,36.16234,-86.77774,"(36.16234, -86.77774)"

In [3]:
art = art.drop(columns = ['Mapped Location'])
art = art.rename(columns = {'Title': 'title', 'Last Name': 'last_name', 
                            'First Name': 'first_name', 'Location': 'loc', 
                            'Medium': 'medium',  'Type': 'art_type', 'Description': 'desc', 
                            'Latitude': 'lat', 'Longitude': 'lng'})

### More exploration with pandas

 - .isnull.sum()
 - .value_counts()
 - .to_frame()
 - .reset_index()
 - .replace()
 - .describe()

In [4]:
art.head(-1)

,title,last_name,first_name,loc,medium,art_type,desc,lat,lng
0,[Cross Country Runners],Frost,Miley,"4001 Harding Rd., Nashville TN",Bronze,Sculpture,NaN,36.128560,-86.836600
1,[Fourth and Commerce Sculpture],Walker,Lin,"333 Commerce Street, Nashville TN",NaN,Sculpture,NaN,36.162340,-86.777740
2,12th & Porter Mural,Kennedy,Kim,114 12th Avenue N,Porter all-weather outdoor paint,Mural,Kim Kennedy is a musician and visual artist wh...,36.157900,-86.788170
3,A Splash of Color,Stevenson and Stanley and ROFF (Harroff),Doug and Ronnica and Lynn,616 17th Ave. N.,"Steel, brick, wood, and fabric on frostproof c...",Mural,Painted wooden hoop dancer on a twenty foot po...,36.162020,-86.799750
4,A Story of Nashville,Ridley,Greg,"615 Church Street, Nashville TN",Hammered copper repousse,Frieze,"Inside the Grand Reading Room, this is a serie...",36.162150,-86.782050
...,...,...,...,...,...,...,...,...,...
126,Waveform: Pan American Blues,Sheng,Shan Shan,"1 Terminal Drive, Nashville TN",Cold cast processed glass,Sculpture,A series of 82 glass panels ranging in length ...,36.131510,-86.669450
127,We Are Our Stories,Omari Booker & The REAL Program at Oasis Center,NaN,1037 28th Avenue North,acrylic & spray paint on plywood,Mural,"""We Are Our Stories"" is a public art project t...",36.165101,-86.822209
128,Welcome to Flatrock,Cooper,Michael,3756 Nolensville Rd,Silicate paint on concrete,Mural,Trompe L'oeil animals and architectural stonew...,36.090820,-86.734450
129,Wind Reeds,Kahn,Ned,"1 Terminal Drive, Nashville TN",Aluminum panels,Sculpture,Hinged aluminum panels that cover a wall of th...,36.134690,-86.667770
130,Women Suffrage Memorial,LeQuire,Alan,"600 Charlotte Avenue, Nashville TN",Bronze sculpture,Sculpture,NaN,36.165270,-86.783820

#### Are there missing values in the `art` dataframe?

In [5]:
art.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 132 entries, 0 to 131
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   title       132 non-null    object
 1   last_name   132 non-null    object
 2   first_name  122 non-null    object
 3   loc         131 non-null    object
 4   medium      128 non-null    object
 5   art_type    132 non-null    object
 6   desc        87 non-null     object
 7   lat         132 non-null    float64
 8   lng         132 non-null    float64
dtypes: float64(2), object(7)
memory usage: 9.4+ KB

In [6]:
art.isnull().sum()

title          0
last_name      0
first_name    10
loc            1
medium         4
art_type       0
desc          45
lat            0
lng            0
dtype: int64

#### Determine how many of each art type exists in the `art` dataframe

In [7]:
art.art_type.value_counts()

Sculpture             61
Mural                 38
Monument              16
Various                2
Mosaic                 2
Mobile                 2
Frieze                 2
Street Art             1
Sculpture/Fountain     1
Multipart              1
Furniture              1
Relief                 1
Fountain               1
Stained Glass          1
Bronzes                1
mural                  1
Name: art_type, dtype: int64

#### Save the counts of each type to a new variable - is the new structure a dataframe?

In [8]:
type_counts = art.art_type.value_counts()

In [9]:
type(type_counts)

pandas.core.series.Series

In [10]:
#make series a df
type_counts = type_counts.to_frame()

print(type(type_counts))
type_counts.head(2)

<class 'pandas.core.frame.DataFrame'>

           art_type
Sculpture        61
Mural            38

In [20]:
#reset index resets to 0-based index and moves existing index to a column
type_counts = type_counts.reset_index()
type_counts.head(2)

   level_0  index   art_type  count
0        0      0  Sculpture     61
1        1      1      Mural     38

In [12]:
type_counts.columns = ['art_type', 'count']
type_counts.head(3)

    art_type  count
0  Sculpture     61
1      Mural     38
2   Monument     16

#### look at descriptive statistics for the `type_counts`

In [13]:
type_counts.describe()

           count
count  16.000000
mean    8.250000
std    17.043083
min     1.000000
25%     1.000000
50%     1.000000
75%     2.000000
max    61.000000

#### What are the uniques art types

In [14]:
type_counts.art_type.unique()

array(['Sculpture', 'Mural', 'Monument', 'Various', 'Mosaic', 'Mobile',
       'Frieze', 'Street Art', 'Sculpture/Fountain', 'Multipart',
       'Furniture', 'Relief', 'Fountain', 'Stained Glass', 'Bronzes',
       'mural'], dtype=object)

### Cleanup time!
- change **mural** to **Mural**
- change **Sculpture/Fountain** to **Fountain**
- change **Bronzes** to **Sculpture**

1. Create a dictionary that maps the current values to the new ones
2. Use the `.replace()` method, passing it the mapping dictionary

In [15]:
art_map_dictionary = {'mural': 'Mural', 'Sculpture/Fountain': 'Fountain', 'Bronzes': 'Sculpture' }

In [21]:
art.art_type = art.art_type.replace(art_map_dictionary)

In [22]:
art.art_type.value_counts()

Sculpture        62
Mural            39
Monument         16
Various           2
Mosaic            2
Mobile            2
Frieze            2
Fountain          2
Street Art        1
Multipart         1
Furniture         1
Relief            1
Stained Glass     1
Name: art_type, dtype: int64

#### Load the iris data from seaborn and look at how the average sepal width, sepal length, petal width, and petal length varies by species
 - which species has the smallest petals?

In [23]:
iris_df = sns.load_dataset('iris')
print(iris_df.shape)
iris_df.head()

NameError: name 'sns' is not defined

In [24]:
iris_df.groupby('species').mean()

NameError: name 'iris_df' is not defined